# 指針
# 8つの点にそれぞれ限られるので、一致するものを探す
# 2つ目の点については全部探す必要はない。一致すれば終了

x1, y1, x2, y2 = map(int, input().split())

p_1_list = [
    (x1 + 2, y1 + 1),
    (x1 + 2, y1 - 1),
    (x1 - 2, y1 + 1),
    (x1 - 2, y1 - 1),
    (x1 + 1, y1 + 2),
    (x1 + 1, y1 - 2),
    (x1 - 1, y1 + 2),
    (x1 - 1, y1 - 2),
]

p_2_list = [
    (x2 + 2, y2 + 1),
    (x2 + 2, y2 - 1),
    (x2 - 2, y2 + 1),
    (x2 - 2, y2 - 1),
    (x2 + 1, y2 + 2),
    (x2 + 1, y2 - 2),
    (x2 - 1, y2 + 2),
    (x2 - 1, y2 - 2),
]

p1_p2 = set(p_1_list) & set(p_2_list)
if len(p1_p2) > 0:
    print("Yes")
else:
    print("No")